wrk2/dome-no-cache/100KB/wrk-eth3-rep04.log
Running 30s test @ https://bench-eth2.netdev-lab.org/100k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 1798.454ms, rate sampling interval: 7729ms
  Thread calibration: mean lat.: 1816.590ms, rate sampling interval: 8404ms
  Thread calibration: mean lat.: 1651.074ms, rate sampling interval: 6995ms
  Thread calibration: mean lat.: 1559.368ms, rate sampling interval: 7307ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.96s     4.64s   26.12s    74.05%
    Req/Sec   120.00     16.21   140.00     62.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.06s 
 75.000%    9.01s 
 90.000%   13.35s 
 99.000%   21.97s 
 99.900%   24.76s 
 99.990%   26.10s 
 99.999%   26.13s 
100.000%   26.13s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     109.119     0.000000            1         1.00
    2001.919     0.100000          955         1.11
    3096.575     0.200000         1910         1.25
    4093.951     0.300000         2867         1.43
    5214.207     0.400000         3823         1.67
    6057.983     0.500000         4778         2.00
    6553.599     0.550000         5252         2.22
    7061.503     0.600000         5731         2.50
    7679.999     0.650000         6208         2.86
    8327.167     0.700000         6684         3.33
    9011.199     0.750000         7166         4.00
    9297.919     0.775000         7402         4.44
    9617.407     0.800000         7645         5.00
   10018.815     0.825000         7877         5.71
   10641.407     0.850000         8115         6.67
   11911.167     0.875000         8357         8.00
   12754.943     0.887500         8474         8.89
   13352.959     0.900000         8595        10.00
   14065.663     0.912500         8714        11.43
   14925.823     0.925000         8832        13.33
   15736.831     0.937500         8951        16.00
   16252.927     0.943750         9011        17.78
   16924.671     0.950000         9071        20.00
   17612.799     0.956250         9130        22.86
   18481.151     0.962500         9189        26.67
   19464.191     0.968750         9253        32.00
   19922.943     0.971875         9283        35.56
   20119.551     0.975000         9309        40.00
   20479.999     0.978125         9340        45.71
   20807.679     0.981250         9370        53.33
   21282.815     0.984375         9399        64.00
   21413.887     0.985938         9415        71.11
   21528.575     0.987500         9428        80.00
   21823.487     0.989062         9445        91.43
   22200.319     0.990625         9458       106.67
   22429.695     0.992188         9474       128.00
   22593.535     0.992969         9481       142.22
   22822.911     0.993750         9488       160.00
   23003.135     0.994531         9496       182.86
   23265.279     0.995313         9503       213.33
   23592.959     0.996094         9510       256.00
   23805.951     0.996484         9514       284.44
   23937.023     0.996875         9518       320.00
   24068.095     0.997266         9521       365.71
   24150.015     0.997656         9525       426.67
   24428.543     0.998047         9529       512.00
   24608.767     0.998242         9531       568.89
   24657.919     0.998437         9533       640.00
   24674.303     0.998633         9534       731.43
   24723.455     0.998828         9536       853.33
   24772.607     0.999023         9538      1024.00
   24870.911     0.999121         9539      1137.78
   24920.063     0.999219         9540      1280.00
   25067.519     0.999316         9541      1462.86
   25247.743     0.999414         9542      1706.67
   25313.279     0.999512         9543      2048.00
   25313.279     0.999561         9543      2275.56
   25608.191     0.999609         9544      2560.00
   25608.191     0.999658         9544      2925.71
   25722.879     0.999707         9545      3413.33
   25722.879     0.999756         9545      4096.00
   25722.879     0.999780         9545      4551.11
   26099.711     0.999805         9546      5120.00
   26099.711     0.999829         9546      5851.43
   26099.711     0.999854         9546      6826.67
   26099.711     0.999878         9546      8192.00
   26099.711     0.999890         9546      9102.22
   26132.479     0.999902         9547     10240.00
   26132.479     1.000000         9547          inf
#[Mean    =     6960.023, StdDeviation   =     4635.575]
#[Max     =    26116.096, Total count    =         9547]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14114 requests in 30.07s, 1.35GB read
  Socket errors: connect 0, read 0, write 0, timeout 71
Requests/sec:    469.37
Transfer/sec:     46.07MB