wrk2/dome-no-cache/100KB/wrk-eth3-rep10.log
Running 30s test @ https://bench-eth2.netdev-lab.org/100k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 1322.832ms, rate sampling interval: 6393ms
  Thread calibration: mean lat.: 1699.903ms, rate sampling interval: 8708ms
  Thread calibration: mean lat.: 1629.882ms, rate sampling interval: 8855ms
  Thread calibration: mean lat.: 1715.664ms, rate sampling interval: 7766ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.90s     4.49s   24.48s    74.92%
    Req/Sec   122.00     21.15   152.00     66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.74s 
 75.000%    8.00s 
 90.000%   11.98s 
 99.000%   20.43s 
 99.900%   22.15s 
 99.990%   23.67s 
 99.999%   24.49s 
100.000%   24.49s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      14.063     0.000000            1         1.00
    1377.279     0.100000          943         1.11
    2347.007     0.200000         1893         1.25
    3022.847     0.300000         2829         1.43
    3872.767     0.400000         3772         1.67
    4743.167     0.500000         4716         2.00
    5197.823     0.550000         5190         2.22
    5758.975     0.600000         5658         2.50
    6434.815     0.650000         6132         2.86
    7012.351     0.700000         6602         3.33
    8003.583     0.750000         7074         4.00
    8544.255     0.775000         7309         4.44
    9043.967     0.800000         7545         5.00
    9584.639     0.825000         7783         5.71
   10346.495     0.850000         8016         6.67
   11165.695     0.875000         8252         8.00
   11583.487     0.887500         8373         8.89
   11984.895     0.900000         8488        10.00
   12443.647     0.912500         8606        11.43
   12951.551     0.925000         8723        13.33
   14368.767     0.937500         8841        16.00
   14901.247     0.943750         8900        17.78
   15654.911     0.950000         8959        20.00
   16326.655     0.956250         9018        22.86
   17252.351     0.962500         9077        26.67
   18120.703     0.968750         9136        32.00
   18415.615     0.971875         9165        35.56
   18677.759     0.975000         9195        40.00
   18939.903     0.978125         9225        45.71
   19202.047     0.981250         9258        53.33
   19496.959     0.984375         9284        64.00
   19709.951     0.985938         9298        71.11
   19972.095     0.987500         9314        80.00
   20152.319     0.989062         9327        91.43
   20627.455     0.990625         9342       106.67
   20856.831     0.992188         9357       128.00
   20938.751     0.992969         9365       142.22
   21381.119     0.993750         9372       160.00
   21495.807     0.994531         9382       182.86
   21528.575     0.995313         9386       213.33
   21659.647     0.996094         9394       256.00
   21708.799     0.996484         9397       284.44
   21774.335     0.996875         9401       320.00
   21839.871     0.997266         9406       365.71
   21856.255     0.997656         9409       426.67
   22003.711     0.998047         9412       512.00
   22085.631     0.998242         9415       568.89
   22102.015     0.998437         9416       640.00
   22118.399     0.998633         9418       731.43
   22134.783     0.998828         9419       853.33
   22151.167     0.999023         9421      1024.00
   22331.391     0.999121         9422      1137.78
   22364.159     0.999219         9423      1280.00
   22757.375     0.999316         9424      1462.86
   22953.983     0.999414         9425      1706.67
   23347.199     0.999512         9426      2048.00
   23347.199     0.999561         9426      2275.56
   23527.423     0.999609         9427      2560.00
   23527.423     0.999658         9427      2925.71
   23658.495     0.999707         9428      3413.33
   23658.495     0.999756         9428      4096.00
   23658.495     0.999780         9428      4551.11
   23674.879     0.999805         9429      5120.00
   23674.879     0.999829         9429      5851.43
   23674.879     0.999854         9429      6826.67
   23674.879     0.999878         9429      8192.00
   23674.879     0.999890         9429      9102.22
   24494.079     0.999902         9430     10240.00
   24494.079     1.000000         9430          inf
#[Mean    =     5904.497, StdDeviation   =     4491.421]
#[Max     =    24477.696, Total count    =         9430]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14046 requests in 30.02s, 1.35GB read
  Socket errors: connect 0, read 0, write 0, timeout 249
Requests/sec:    467.87
Transfer/sec:     45.91MB